ИС_СПОРТ_2022/src/Documents/ЗаявкаНаПроведениеСоревнования/ЗаявкаНаПроведениеСоревнования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПроведениеСоревнования</name>
  <registerRecords>InformationRegister.ЗаявкиНаПроведениеСоревнования</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Соревнование</name>
    <type>
      <types>CatalogRef.Соревнование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставУчастников</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.СпортивныеДисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.Команды</types>
      </type>
    </attributes>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/InformationRegisters/СоставУчащихсяСпортивногоУчреждения/СоставУчащихсяСпортивногоУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставУчащихсяСпортивногоУчреждения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпортаУдалить</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/МеждународныеВозрастныеГруппы/МеждународныеВозрастныеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МеждународныеВозрастныеГруппы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МеждународнаяВозрастнаяГруппа</name>
    <type>
      <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
    </type>
  </resources>
  <dimensions>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/ЭтапыСпортивнойПодготовкиСпортсменов/ЭтапыСпортивнойПодготовкиСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭтапыСпортивнойПодготовкиСпортсменов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
    </type>
  </resources>
  <resources>
    <name>СпортивнаяПрограмма</name>
    <type>
      <types>CatalogRef.СпортивныеПрограммы</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапУдалить</name>
    <type>
      <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпортивнаяПрограммаУдалить</name>
    <type>
      <types>CatalogRef.СпортивныеПрограммы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Enums/СтатусыСпортсменов/СтатусыСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСпортсменов</name>
  <enumValues>
    <name>Спортсмен</name>
  </enumValues>
  <enumValues>
    <name>ЗанимающийсяСпортсмен</name>
  </enumValues>
  <enumValues>
    <name>ЗанимающийсяОбучающийся</name>
  </enumValues>
  <enumValues>
    <name>СпортсменДругогоСпортивногоУчреждения</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Enums/ПолФизическогоЛица/ПолФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическогоЛица</name>
  <enumValues>
    <name>Женский</name>
  </enumValues>
  <enumValues>
    <name>Мужской</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Catalogs/Спортсмены/Спортсмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спортсмены</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСпортсмена</name>
    <type>
      <types>EnumRef.СтатусыСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонДиспансеризации</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>СовпадаетАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОсобенностиЗдоровья</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяИнвалидностьПоОбщемуЗаболеванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеютсяИнтеллектуальныеНарушения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеЗрения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеСлуха</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеОДА</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПФЗ</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиПоказателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиФизическогоЗдоровья</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПолисаОМС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Documents/ЗаявкаНаПроведениеСоревнования/Forms/ФормаЗаполненияПоГруппам/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ЗаполнитьТаблицуСпортсменов(Параметры.СтруктураПараметров);
	
	Для Каждого Параметр Из Параметры.СтруктураПараметров Цикл
		// {Рарус adilas #1.0.0.2 -Испрваления SonarQube 2021.04.23
		// Удалены/добавлены пробелы
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЭтапов, Параметр.Ключ, Параметр.Значение, Истина);
		Если Параметр.Ключ = "ОФП" Тогда
			ОФП = Параметр.Значение;
		КонецЕсли;
		Если Параметр.Ключ = "Тренер" ИЛИ Параметр.Ключ = "Этап" Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЭтапов, Параметр.Ключ, Параметр.Значение, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		// }Рарус adilas #1.0.0.2 -Исправления SonarQube 2021.04.23
		КонецЕсли;	
	КонецЦикла;	
		
	УстановитьОтборНаДинамическийСписок();
	
	Если Не УчетСпортсменовВызовСервера.ТекущиеПараметрыФО(Элементы.СписокКомандСпортивноеУчреждение).ВозрастныеГруппыОрганизация Тогда
		Элементы.СписокСпортсменовМеждународнаяВозрастнаяГруппа.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбор(Команда)
	массивВыделенныхСтрок = Элементы.СписокЭтапов.ВыделенныеСтроки;
	Если массивВыделенныхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ВыбратьУчастниковПродолжить(массивВыделенныхСтрок);
КонецПроцедуры

&НаКлиенте
Процедура ВыборСпортсменов(Команда)
	массивВыделенныхСтрок = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.СписокСпортсменов.ВыделенныеСтроки Цикл
		строки = Элементы.СписокСпортсменов.ДанныеСтроки(ВыделеннаяСтрока);
		массивВыделенныхСтрок.Добавить(строки.Спортсмен);
	КонецЦикла;
	Если массивВыделенныхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ОповеститьОВыборе(ДинамическийСписокВТаблицуЗначений("СписокСпортсменов", массивВыделенныхСтрок));
КонецПроцедуры

#КонецОбласти

// {Рарус adilas #1.0.0.2 -Испрваления SonarQube 2021.04.23
// Переименована область и имена процедур
#Область ОбработчикиСобытийЭлементовДинамическогоСпискаСписокЭтапов

&НаКлиенте
Процедура СписокЭтаповВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МассивУчастников = Новый Массив;
	МассивУчастников.Добавить(ВыбраннаяСтрока);
	ВыбратьУчастниковПродолжить(МассивУчастников);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭтаповПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.СписокЭтапов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ТекущаяКомандаСписка = Неопределено;
	Иначе
		ТекущаяКомандаСписка = ТекДанные.Регистратор;
	КонецЕсли;
	Если ТекущаяКомандаСписка <> ТекущийДокумент Тогда
		ТекущийДокумент = ТекущаяКомандаСписка;
		УстановитьОтборНаДинамическийСписок();
	КонецЕсли;
	
КонецПроцедуры

// }Рарус adilas #1.0.0.2 -Исправления SonarQube 2021.04.23

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьУчастниковПродолжить(массивВыделенныхСтрок)
	ОповеститьОВыборе(ДинамическийСписокВТаблицуЗначений("СписокЭтапов", массивВыделенныхСтрок));  
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборНаДинамическийСписок()
	// {Рарус adilas #1.0.0.2 -Испрваления SonarQube 2021.04.23	
	Элементы.СписокСпортсменов.ОтборСтрок = Новый ФиксированнаяСтруктура("Регистратор", ТекущийДокумент);	
	// }Рарус adilas #1.0.0.2 -Исправления SonarQube 2021.04.23
КонецПроцедуры

&НаСервере
Функция ДинамическийСписокВТаблицуЗначений(ИмяСписка, массивДокументов)
	
	Если ИмяСписка = "СписокСпортсменов" Тогда
		ЗначениеФильтра = "Спортсмен";
	Иначе
		ЗначениеФильтра = "Регистратор";
	КонецЕсли;
	
	МассивВыделенныхСтрок = Новый Массив;
	Для Каждого строкаРезультат Из СписокСпортсменов Цикл
	// {Рарус adilas #1.0.0.2 -Испрваления SonarQube 2021.04.23
		Если НЕ массивДокументов.Найти(строкаРезультат[ЗначениеФильтра]) = Неопределено Тогда
		
			Если ОФП Тогда
			   структура = Новый Структура("Спортсмен, МеждународнаяВозрастнаяГруппа, Этап, Тренер, Пол, ГодРождения"
			     , строкаРезультат.Спортсмен, строкаРезультат.МеждународнаяВозрастнаяГруппа, строкаРезультат.Регистратор.Группа, строкаРезультат.Регистратор.Тренер, строкаРезультат.Пол, строкаРезультат.ГодРождения);
			   МассивВыделенныхСтрок.Добавить(структура);
			Иначе	
			   МассивВыделенныхСтрок.Добавить(строкаРезультат.Спортсмен);
			КонецЕсли;   
		КонецЕсли;	
	КонецЦикла;
	
	Возврат МассивВыделенныхСтрок;
	// }Рарус adilas #1.0.0.2 -Исправления SonarQube 2021.04.23
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуСпортсменов(ПараметрыДанных)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", ПараметрыДанных.Организация);
	Запрос.УстановитьПараметр("УчебныйГод" , ПараметрыДанных.УчебныйГод);
	Запрос.УстановитьПараметр("ВидСпорта"  , ПараметрыДанных.ВидСпорта);
	Запрос.УстановитьПараметр("Текущаядата", ПараметрыДанных.Текущаядата);
	Запрос.УстановитьПараметр("СтатусСпортсмена", Перечисления.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
	               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация
	               |ПОМЕСТИТЬ ТЗСоставУчащихся
	               |ИЗ
	               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&ТекущаяДата, Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
	               |ГДЕ
	               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВозрастныеГруппы.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	               |	ВозрастныеГруппы.Спортсмен КАК Спортсмен
	               |ПОМЕСТИТЬ ТЗВозрастныеГруппы
	               |ИЗ
	               |	РегистрСведений.МеждународныеВозрастныеГруппы.СрезПоследних(
	               |			,
	               |			Организация = &Организация
	               |				И УчебныйГод = &УчебныйГод
	               |				И ВидСпорта = &ВидСпорта) КАК ВозрастныеГруппы
                   |ГДЕ
                   |    %1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозрастныеГруппы.МеждународнаяВозрастнаяГруппа,
	               |	ВозрастныеГруппы.Спортсмен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЭтапыСпортивнойПодготовкиСпортсменов.Регистратор КАК Регистратор,
	               |	ЭтапыСпортивнойПодготовкиСпортсменов.Спортсмен КАК Спортсмен
	               |ПОМЕСТИТЬ ТЗЭтапыСпортПодготовки
	               |ИЗ
	               |	РегистрСведений.ЭтапыСпортивнойПодготовкиСпортсменов.СрезПоследних(
	               |			,
	               |			Организация = &Организация
	               |				И ВидСпорта = &ВидСпорта) КАК ЭтапыСпортивнойПодготовкиСпортсменов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапыСпортивнойПодготовкиСпортсменов.Регистратор,
	               |	ЭтапыСпортивнойПодготовкиСпортсменов.Спортсмен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Спортсмены.Ссылка КАК Спортсмен,
	               |	Спортсмены.ФизическоеЛицо.ГодРождения КАК ГодРождения,
	               |	ВЫБОР
	               |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
	               |			ТОГДА ""М""
	               |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский)
	               |			ТОГДА ""Ж""
	               |		ИНАЧЕ ""Не задан""
	               |	КОНЕЦ КАК Пол,
	               |	ТЗВозрастныеГруппы.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	               |	ТЗЭтапыСпортПодготовки.Регистратор КАК Регистратор
	               |ИЗ
	               |	ТЗСоставУчащихся КАК ТЗСоставУчащихся
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спортсмены КАК Спортсмены
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗВозрастныеГруппы КАК ТЗВозрастныеГруппы
	               |			ПО Спортсмены.Ссылка = ТЗВозрастныеГруппы.Спортсмен
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |			ПО Спортсмены.ФизическоеЛицо = ФизическиеЛица.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗЭтапыСпортПодготовки КАК ТЗЭтапыСпортПодготовки
	               |			ПО (ТЗЭтапыСпортПодготовки.Спортсмен = Спортсмены.Ссылка)
	               |		ПО ТЗСоставУчащихся.Спортсмен = Спортсмены.Ссылка
	               |ГДЕ
                   |    Спортсмены.СтатусСпортсмена <> &СтатусСпортсмена И
                   |    %2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Спортсмены.Ссылка,
	               |	ТЗВозрастныеГруппы.МеждународнаяВозрастнаяГруппа,
	               |	Спортсмены.ФизическоеЛицо.ГодРождения,
	               |	ВЫБОР
	               |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
	               |			ТОГДА ""М""
	               |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Женский)
	               |			ТОГДА ""Ж""
	               |		ИНАЧЕ ""Не задан""
	               |	КОНЕЦ,
	               |	ТЗЭтапыСпортПодготовки.Регистратор";
	// {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
    Если УчетСпортсменовВызовСервера.ТекущиеПараметрыФО(Элементы.СписокКомандСпортивноеУчреждение).ВозрастныеГруппыОрганизация Тогда
        // {Рарус kotana #IN-9625 2021.06.04 -Ошибка при заполнении табличной части ведомости КПН
        //Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", ?(ПараметрыДанных.Свойство("СписокВозрастныхГрупп"), " ВозрастныеГруппы.МеждународнаяВозрастнаяГруппа В(&МеждународнаяВозрастнаяГруппа) И", "Истина"));
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", ?(ПараметрыДанных.Свойство("СписокВозрастныхГрупп"), " ВозрастныеГруппы.МеждународнаяВозрастнаяГруппа В(&МеждународнаяВозрастнаяГруппа)", "Истина"));
        // }Рарус kotana #IN-9625 2021.06.04

    Иначе
        // {Рарус kotana #IN-9625 2021.06.17 -Ошибка при заполнении табличной части ведомости КПН
        //Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", ?(ПараметрыДанных.Свойство("СписокВозрастныхГрупп"), "", "Истина"));
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", "Истина");
        // }Рарус kotana #IN-9625 2021.06.17
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%2", ?(ПараметрыДанных.Свойство("Пол"), " ФизическиеЛица.Пол В(&СписокПол)", "Истина"));	
	
	Если ПараметрыДанных.Свойство("СписокВозрастныхГрупп") Тогда
		Запрос.УстановитьПараметр("МеждународнаяВозрастнаяГруппа", ПараметрыДанных.СписокВозрастныхГрупп);
	КонецЕсли;
	Если ПараметрыДанных.Свойство("Пол") Тогда
		Запрос.УстановитьПараметр("СписокПол", ПараметрыДанных.Пол);
	КонецЕсли;
	
	СписокСпортсменов.Загрузить(Запрос.Выполнить().Выгрузить());
	// }Рарус adilas #1.0.0.2 -SonarQube 2021.04.23

КонецПроцедуры

#КонецОбласти
